#5. Реализовать функцию get_jokes(), возвращающую n шуток, сформированных из трех случайных слов,
#взятых из трёх заданных списков:

#nouns = ["автомобиль", "лес", "огонь", "город", "дом"]
#adverbs = ["сегодня", "вчера", "завтра", "позавчера", "ночью"]
#adjectives = ["веселый", "яркий", "зеленый", "утопичный", "мягкий"]

def get_jokes():
    print('перевод: ', dictionary.get(wrd))
